xml/Documents/ПриходныйКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПриходныйКассовыйОрдер</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

xml/InformationRegisters/Расш6270_ДоступыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>Расш6270_ДоступыПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xml/Documents/ПриходныйКассовыйОрдер/Forms/ФормаСпискаДокументов/Ext/Form/Module.bsl
&НаСервере
Процедура Расш6270_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если РольДоступна("ПолныеПрава") Тогда // Проверить на полные права
		Возврат;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Расш6270_ДоступыПользователей.ОбъектДоступа КАК Касса
		|ИЗ
		|	РегистрСведений.Расш6270_ДоступыПользователей КАК Расш6270_ДоступыПользователей
		|ГДЕ
		|	Расш6270_ДоступыПользователей.Пользователь = &Пользователь
		|	И Расш6270_ДоступыПользователей.ОбъектДоступа ССЫЛКА Справочник.Кассы";
	
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
		МассивКасс = ВыборкаДетальныеЗаписи.ВыгрузитьКолонку("Касса");
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПриходныеКассовыеОрдера,
												"Касса",
												МассивКасс,
												ВидСравненияКомпоновкиДанных.ВСписке,
												,
												Истина);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры
